#+title: My Literate Emacs Configuration
#+author: Christian Dijkstra
#+email: chdka@public-files.de
#+startup: noptag indent content
#+todo: DISABLED(d) | ENABLED(e)
#+todo: BUG(b) FEATURE(f) | FIXED(x)
#+tags: @behaviour(b) @ui(u) env_var(v)
#+tags: { issue(i) feature(f) }

**** Assign a backup and auto-save folder             :@behaviour:env_var:
Stop Emacs littering all my folders with backup files and auto-save files.
Assign a folder for them, and use a flat structure

#+begin_src emacs-lisp
(defconst chdka-emacs-const-backup-rootdir 
          (if (getenv "CHDKA_HOME_CACHE")
              (expand-file-name (concat (getenv "CHDKA_HOME_CACHE") "/emacs/backup/"))
            (expand-file-name "~/.cache/emacs/backup/"))
  "Personal Emacs backup root.")

(if (not (file-exists-p chdka-emacs-const-backup-rootdir))
    (make-directory chdka-emacs-const-backup-rootdir t))
(setq-default backup-directory-alist 
              `((".*" . ,chdka-emacs-const-backup-rootdir)))
#+end_src

#+RESULTS:
: ((.* . d:/christian/.cache/emacs/backup/))

#+begin_src emacs-lisp 
(defconst chdka-emacs-const-autosave-rootdir
          (if (getenv "CHDKA_HOME_CACHE")
              (expand-file-name (concat (getenv "CHDKA_HOME_CACHE") "/emacs/auto-save/"))
            (expand-file-name "~/.cache/emacs/auto-save/"))
  "Personal Emacs auto-save root.")

(if (not (file-exists-p chdka-emacs-const-autosave-rootdir))
    (make-directory chdka-emacs-const-autosave-rootdir t))
(setq-default auto-save-file-name-transforms 
              `((".*" ,(file-name-as-directory chdka-emacs-const-autosave-rootdir) t)))

#+end_src

#+RESULTS:
| .* | d:/christian/.cache/emacs/auto-save/ | t |

**** Set the housekeeping for backup and auto-save            :@behaviour:
For the backup activate some setting regarding version and age of those versions

#+begin_src emacs-lisp
(setq-default make-backup-files t    ; backup of a file the first time it is saved
              backup-by-copying t
              version-control t      ; version numbers for backup files
              delete-old-versions t  ; delete old versions silently
              delete-by-moving-to-trash t
              kept-old-versions 6    ; oldest version to keep
              kept-new-versions 9    ; newest version to keep
)
#+end_src

#+RESULTS:
: 9

Set the intervals for writing an auto-save file and the timeout.

#+begin_src emacs-lisp
(setq-default auto-save-default t    ; auto-save every buffer that visits a file
              auto-save-timeout 20   ; number of seconds idle time before auto-save
              auto-save-interval 200 ; number of keystrokes between auto-saves
) 
#+end_src

#+RESULTS:
: 200

**** Set a visual indicator if there is a newline or not             :@ui:

#+begin_src emacs-lisp
(setq visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow))
#+end_src

#+RESULTS:
| left-curly-arrow | right-curly-arrow |

